[
    {
        "post_id": 1,
        "user_id": 1,
        "username": "momonan0412",
        "subject": "Fan Meeting!?",
        "message": "Immerse yourself in a one-of-a-kind experience at Matsumoto Momona&#039;s fan meet and greet, where the renowned Japanese idol will captivate fans with her charm, host a Q&amp;A session, sign autographs, and share memorable moments in an intimate setting.",
        "image": "Flex.jpg"
    },
    {
        "post_id": 2,
        "user_id": 1,
        "username": "momonan0412",
        "subject": "Japanese Festival!",
        "message": "Indulge in the vibrant traditions and cultural richness of Japan at our Japanese Festival, where attendees can savor authentic cuisine, witness mesmerizing traditional performances, and partake in various hands-on activities celebrating the beauty of Japanese heritage. Join us for a day filled with immersive experiences and the lively spirit of Japan!",
        "image": "Festival.jpg"
    },
    {
        "post_id": 3,
        "user_id": 1,
        "username": "momonan0412",
        "subject": "Yoasobi Live Tour!",
        "message": "Embark on a thrilling musical journey with the Yoasobi Live Tour! Immerse yourself in the dynamic performance of the acclaimed Japanese musical duo as they bring their chart-topping hits to life, promising an unforgettable night of entertainment and energy.",
        "image": "Yoasobi Live.webp"
    },
    {
        "post_id": 4,
        "user_id": 1,
        "username": "momonan0412",
        "subject": "Cherry Blossom Viewing!",
        "message": "Celebrate the ephemeral beauty of spring at our Cherry Blossom Viewing event, where nature&#039;s breathtaking display takes center stage. Join us for a serene and picturesque experience, surrounded by the delicate hues of cherry blossoms in full bloom, creating a moment of tranquility and wonder.",
        "image": "Cherry Blossom.png"
    },
    {
        "post_id": 5,
        "user_id": 1,
        "username": "momonan0412",
        "subject": "Anime Convention!",
        "message": "Dive into the vibrant world of anime at our Anime Convention, where fans unite to celebrate their passion for Japanese animation. Immerse yourself in a bustling atmosphere filled with cosplay, exclusive screenings, and meet-and-greet sessions with industry professionals, creating an unforgettable experience for anime enthusiasts.",
        "image": "Anime Convention.jpeg"
    }
]